OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1946.h
#define _SEG16COM3              0x01
#define _SEG17COM3              0x02
#define _SEG18COM3              0x04
#define _SEG19COM3              0x08
#define _SEG20COM3              0x10
#define _SEG21COM3              0x20
#define _SEG22COM3              0x40
#define _SEG23COM3              0x80

//==============================================================================


//==============================================================================
//        LCDDATA12 Bits

extern __at(0x07AC) __sfr LCDDATA12;

typedef struct
  {
  unsigned SEG24COM0            : 1;
  unsigned SEG25COM0            : 1;
  unsigned SEG26COM0            : 1;
  unsigned SEG27COM0            : 1;
  unsigned SEG28COM0            : 1;
  unsigned SEG29COM0            : 1;
  unsigned SEG30COM0            : 1;
  unsigned SEG31COM0            : 1;
  } __LCDDATA12bits_t;

extern __at(0x07AC) volatile __LCDDATA12bits_t LCDDATA12bits;

#define _SEG24COM0              0x01
#define _SEG25COM0              0x02
#define _SEG26COM0              0x04
#define _SEG27COM0              0x08
#define _SEG28COM0              0x10
#define _SEG29COM0              0x20
#define _SEG30COM0              0x40
#define _SEG31COM0              0x80

//==============================================================================


//==============================================================================
//        LCDDATA13 Bits

extern __at(0x07AD) __sfr LCDDATA13;

typedef struct
  {
  unsigned SEG32COM0            : 1;
  unsigned SEG33COM0            : 1;
  unsigned SEG34COM0            : 1;
  unsigned SEG35COM0            : 1;
  unsigned SEG36COM0            : 1;
  unsigned SEG37COM0            : 1;
  unsigned SEG38COM0            : 1;
  unsigned SEG39COM0            : 1;
  } __LCDDATA13bits_t;

extern __at(0x07AD) volatile __LCDDATA13bits_t LCDDATA13bits;

#define _SEG32COM0              0x01
#define _SEG33COM0              0x02
#define _SEG34COM0              0x04
#define _SEG35COM0              0x08
#define _SEG36COM0              0x10
#define _SEG37COM0              0x20
#define _SEG38COM0              0x40
#define _SEG39COM0              0x80

//==============================================================================


//==============================================================================
//        LCDDATA14 Bits

extern __at(0x07AE) __sfr LCDDATA14;

typedef struct
  {
  unsigned SEG40COM0            : 1;
  unsigned SEG41COM0            : 1;
  unsigned SEG42COM0            : 1;
  unsigned SEG43COM0            : 1;
  unsigned SEG44COM0            : 1;
  unsigned SEG45COM0            : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __LCDDATA14bits_t;

extern __at(0x07AE) volatile __LCDDATA14bits_t LCDDATA14bits;

#define _SEG40COM0              0x01
#define _SEG41COM0              0x02
#define _SEG42COM0              0x04
#define _SEG43COM0              0x08
#define _SEG44COM0              0x10
#define _SEG45COM0              0x20

//==============================================================================


//==============================================================================
//        LCDDATA15 Bits

extern __at(0x07AF) __sfr LCDDATA15;

typedef struct
  {
  unsigned SEG24COM1            : 1;
  unsigned SEG25COM1            : 1;
  unsigned SEG26COM1            : 1;
  unsigned SEG27COM1            : 1;
  unsigned SEG28COM1            : 1;
  unsigned SEG29COM1            : 1;
  unsigned SEG30COM1            : 1;
  unsigned SEG31COM1            : 1;
  } __LCDDATA15bits_t;

extern __at(0x07AF) volatile __LCDDATA15bits_t LCDDATA15bits;

#define _SEG24COM1              0x01
#define _SEG25COM1              0x02
#define _SEG26COM1              0x04
#define _SEG27COM1              0x08
#define _SEG28COM1              0x10
#define _SEG29COM1              0x20
#define _SEG30COM1              0x40
#define _SEG31COM1              0x80

//==============================================================================


//==============================================================================
//        LCDDATA16 Bits

extern __at(0x07B0) __sfr LCDDATA16;

typedef struct
  {
  unsigned SEG32COM1            : 1;
  unsigned SEG33COM1            : 1;
  unsigned SEG34COM1            : 1;
  unsigned SEG35COM1            : 1;
  unsigned SEG36COM1            : 1;
  unsigned SEG37COM1            : 1;
  unsigned SEG38COM1            : 1;
  unsigned SEG39COM1            : 1;
  } __LCDDATA16bits_t;

extern __at(0x07B0) volatile __LCDDATA16bits_t LCDDATA16bits;

#define _SEG32COM1              0x01
#define _SEG33COM1              0x02
#define _SEG34COM1              0x04
#define _SEG35COM1              0x08
#define _SEG36COM1              0x10
#define _SEG37COM1              0x20
#define _SEG38COM1              0x40
#define _SEG39COM1              0x80

//==============================================================================


//==============================================================================
//        LCDDATA17 Bits

extern __at(0x07B1) __sfr LCDDATA17;

typedef struct
  {
  unsigned SEG40COM1            : 1;
  unsigned SEG41COM1            : 1;
  unsigned SEG42COM1            : 1;
  unsigned SEG43COM1            : 1;
  unsigned SEG44COM1            : 1;
  unsigned SEG45COM1            : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __LCDDATA17bits_t;

extern __at(0x07B1) volatile __LCDDATA17bits_t LCDDATA17bits;

#define _SEG40COM1              0x01
#define _SEG41COM1              0x02
#define _SEG42COM1              0x04
#define _SEG43COM1              0x08
#define _SEG44COM1              0x10
#define _SEG45COM1              0x20

//==============================================================================


//==============================================================================
//        LCDDATA18 Bits

extern __at(0x07B2) __sfr LCDDATA18;

typedef struct
  {
  unsigned SEG24COM2            : 1;
  unsigned SEG25COM2            : 1;
  unsigned SEG26COM2            : 1;
  unsigned SEG27COM2            : 1;
  unsigned SEG28COM2            : 1;
  unsigned SEG29COM2            : 1;
  unsigned SEG30COM2            : 1;
  unsigned SEG31COM2            : 1;
  } __LCDDATA18bits_t;

extern __at(0x07B2) volatile __LCDDATA18bits_t LCDDATA18bits;

#define _SEG24COM2              0x01
#define _SEG25COM2              0x02
#define _SEG26COM2              0x04
#define _SEG27COM2              0x08
#define _SEG28COM2              0x10
#define _SEG29COM2              0x20
#define _SEG30COM2              0x40
#define _SEG31COM2              0x80

//==============================================================================


//==============================================================================
//        LCDDATA19 Bits

extern __at(0x07B3) __sfr LCDDATA19;

typedef struct
  {
  unsigned SEG32COM2            : 1;
  unsigned SEG33COM2            : 1;
  unsigned SEG34COM2            : 1;
  unsigned SEG35COM2            : 1;
  unsigned SEG36COM2            : 1;
  unsigned SEG37COM2            : 1;
  unsigned SEG38COM2            : 1;
  unsigned SEG39COM2            : 1;
  } __LCDDATA19bits_t;

extern __at(0x07B3) volatile __LCDDATA19bits_t LCDDATA19bits;

