OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1946.h
#define SEG24COM0               LCDDATA12bits.SEG24COM0         // bit 0
#define SEG25COM0               LCDDATA12bits.SEG25COM0         // bit 1
#define SEG26COM0               LCDDATA12bits.SEG26COM0         // bit 2
#define SEG27COM0               LCDDATA12bits.SEG27COM0         // bit 3
#define SEG28COM0               LCDDATA12bits.SEG28COM0         // bit 4
#define SEG29COM0               LCDDATA12bits.SEG29COM0         // bit 5
#define SEG30COM0               LCDDATA12bits.SEG30COM0         // bit 6
#define SEG31COM0               LCDDATA12bits.SEG31COM0         // bit 7

#define SEG32COM0               LCDDATA13bits.SEG32COM0         // bit 0
#define SEG33COM0               LCDDATA13bits.SEG33COM0         // bit 1
#define SEG34COM0               LCDDATA13bits.SEG34COM0         // bit 2
#define SEG35COM0               LCDDATA13bits.SEG35COM0         // bit 3
#define SEG36COM0               LCDDATA13bits.SEG36COM0         // bit 4
#define SEG37COM0               LCDDATA13bits.SEG37COM0         // bit 5
#define SEG38COM0               LCDDATA13bits.SEG38COM0         // bit 6
#define SEG39COM0               LCDDATA13bits.SEG39COM0         // bit 7

#define SEG40COM0               LCDDATA14bits.SEG40COM0         // bit 0
#define SEG41COM0               LCDDATA14bits.SEG41COM0         // bit 1
#define SEG42COM0               LCDDATA14bits.SEG42COM0         // bit 2
#define SEG43COM0               LCDDATA14bits.SEG43COM0         // bit 3
#define SEG44COM0               LCDDATA14bits.SEG44COM0         // bit 4
#define SEG45COM0               LCDDATA14bits.SEG45COM0         // bit 5

#define SEG24COM1               LCDDATA15bits.SEG24COM1         // bit 0
#define SEG25COM1               LCDDATA15bits.SEG25COM1         // bit 1
#define SEG26COM1               LCDDATA15bits.SEG26COM1         // bit 2
#define SEG27COM1               LCDDATA15bits.SEG27COM1         // bit 3
#define SEG28COM1               LCDDATA15bits.SEG28COM1         // bit 4
#define SEG29COM1               LCDDATA15bits.SEG29COM1         // bit 5
#define SEG30COM1               LCDDATA15bits.SEG30COM1         // bit 6
#define SEG31COM1               LCDDATA15bits.SEG31COM1         // bit 7

#define SEG32COM1               LCDDATA16bits.SEG32COM1         // bit 0
#define SEG33COM1               LCDDATA16bits.SEG33COM1         // bit 1
#define SEG34COM1               LCDDATA16bits.SEG34COM1         // bit 2
#define SEG35COM1               LCDDATA16bits.SEG35COM1         // bit 3
#define SEG36COM1               LCDDATA16bits.SEG36COM1         // bit 4
#define SEG37COM1               LCDDATA16bits.SEG37COM1         // bit 5
#define SEG38COM1               LCDDATA16bits.SEG38COM1         // bit 6
#define SEG39COM1               LCDDATA16bits.SEG39COM1         // bit 7

#define SEG40COM1               LCDDATA17bits.SEG40COM1         // bit 0
#define SEG41COM1               LCDDATA17bits.SEG41COM1         // bit 1
#define SEG42COM1               LCDDATA17bits.SEG42COM1         // bit 2
#define SEG43COM1               LCDDATA17bits.SEG43COM1         // bit 3
#define SEG44COM1               LCDDATA17bits.SEG44COM1         // bit 4
#define SEG45COM1               LCDDATA17bits.SEG45COM1         // bit 5

#define SEG24COM2               LCDDATA18bits.SEG24COM2         // bit 0
#define SEG25COM2               LCDDATA18bits.SEG25COM2         // bit 1
#define SEG26COM2               LCDDATA18bits.SEG26COM2         // bit 2
#define SEG27COM2               LCDDATA18bits.SEG27COM2         // bit 3
#define SEG28COM2               LCDDATA18bits.SEG28COM2         // bit 4
#define SEG29COM2               LCDDATA18bits.SEG29COM2         // bit 5
#define SEG30COM2               LCDDATA18bits.SEG30COM2         // bit 6
#define SEG31COM2               LCDDATA18bits.SEG31COM2         // bit 7

#define SEG32COM2               LCDDATA19bits.SEG32COM2         // bit 0
#define SEG33COM2               LCDDATA19bits.SEG33COM2         // bit 1
#define SEG34COM2               LCDDATA19bits.SEG34COM2         // bit 2
#define SEG35COM2               LCDDATA19bits.SEG35COM2         // bit 3
#define SEG36COM2               LCDDATA19bits.SEG36COM2         // bit 4
#define SEG37COM2               LCDDATA19bits.SEG37COM2         // bit 5
#define SEG38COM2               LCDDATA19bits.SEG38COM2         // bit 6
#define SEG39COM2               LCDDATA19bits.SEG39COM2         // bit 7

#define SEG40COM2               LCDDATA20bits.SEG40COM2         // bit 0
#define SEG41COM2               LCDDATA20bits.SEG41COM2         // bit 1
#define SEG42COM2               LCDDATA20bits.SEG42COM2         // bit 2
#define SEG43COM2               LCDDATA20bits.SEG43COM2         // bit 3
#define SEG44COM2               LCDDATA20bits.SEG44COM2         // bit 4
#define SEG45COM2               LCDDATA20bits.SEG45COM2         // bit 5

#define SEG24COM3               LCDDATA21bits.SEG24COM3         // bit 0
#define SEG25COM3               LCDDATA21bits.SEG25COM3         // bit 1
#define SEG26COM3               LCDDATA21bits.SEG26COM3         // bit 2
#define SEG27COM3               LCDDATA21bits.SEG27COM3         // bit 3
#define SEG28COM3               LCDDATA21bits.SEG28COM3         // bit 4
#define SEG29COM3               LCDDATA21bits.SEG29COM3         // bit 5
#define SEG30COM3               LCDDATA21bits.SEG30COM3         // bit 6
#define SEG31COM3               LCDDATA21bits.SEG31COM3         // bit 7

#define SEG32COM3               LCDDATA22bits.SEG32COM3         // bit 0
#define SEG33COM3               LCDDATA22bits.SEG33COM3         // bit 1
#define SEG34COM3               LCDDATA22bits.SEG34COM3         // bit 2
#define SEG35COM3               LCDDATA22bits.SEG35COM3         // bit 3
#define SEG36COM3               LCDDATA22bits.SEG36COM3         // bit 4
#define SEG37COM3               LCDDATA22bits.SEG37COM3         // bit 5
#define SEG38COM3               LCDDATA22bits.SEG38COM3         // bit 6
#define SEG39COM3               LCDDATA22bits.SEG39COM3         // bit 7

#define SEG40COM3               LCDDATA23bits.SEG40COM3         // bit 0
#define SEG41COM3               LCDDATA23bits.SEG41COM3         // bit 1
#define SEG42COM3               LCDDATA23bits.SEG42COM3         // bit 2
#define SEG43COM3               LCDDATA23bits.SEG43COM3         // bit 3
#define SEG44COM3               LCDDATA23bits.SEG44COM3         // bit 4
#define SEG45COM3               LCDDATA23bits.SEG45COM3         // bit 5

#define LP0                     LCDPSbits.LP0                   // bit 0
#define LP1                     LCDPSbits.LP1                   // bit 1
#define LP2                     LCDPSbits.LP2                   // bit 2
#define LP3                     LCDPSbits.LP3                   // bit 3
#define WA                      LCDPSbits.WA                    // bit 4
#define LCDA                    LCDPSbits.LCDA                  // bit 5
#define BIASMD                  LCDPSbits.BIASMD                // bit 6
#define WFT                     LCDPSbits.WFT                   // bit 7

